package com.javarush.task.pro.task07.task0702;

/* 
Максимальное целое
Создай по одной переменной каждого примитивного целочисленного типа в классе Solution.
Этим переменным присвой максимально возможное для них значение.
Никаких методов создавать не нужно.

Требования:
•	В классе Solution должны быть созданы переменные всех примитивных целочисленных типов.
•	Всем целочисленным переменным должно быть присвоено максимально возможное для них значение.
•	В классе Solution не должно быть создано никаких методов.
*/

public class Solution {
    //напишите тут ваш код
}
