package com.javarush.task.pro.task06.task0602;

/* 
Упорядоченная информация
Перед тобой — плохой пример использования методов:

Методы разделили двустишие;
Одну строку кода не стоит оборачивать в отдельный метод.
Перепиши код так, чтобы весь текст выводился в методе main, а остальные методы удали.
Вывод программы не должен измениться.
Требования:
•	Метод main() должен быть единственным методом в классе Solution.
•	Вывод в консоли должен соответствовать условию задачи.
*/

public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код
        print1();
        print2();
    }
    public static void print1(){
        System.out.println("Я — поэт, зовусь я Цветик.");
    }
    public static void print2(){
        System.out.println("От меня вам всем приветик.");
    }
}
