package com.javarush.task.pro.task02.task0206;
/*
«Я снова по объявлению…»
В методе main объяви переменные word, phrase, line и text типа String.
Присвой им разные значения. Используй одну команду для создания и инициализации переменных.
Значениями могут быть любые строки.

Требования:
•	В методе main объяви четыре переменные типа String.
•	Назови переменные именами word, phrase, line и text.
•	Переменным сразу присвой значения.
•	У всех переменных должны быть разные значения.
 */
public class Solution {

    public static void main(String[] args) {
        //напишите тут ваш код

    }
}
