package com.javarush.task.task01.task0101;

/* 
Я думаю, быть программистом круто
Напиши программу, которая выводит на экран надпись:

Я думаю, быть программистом круто

Требования:
•	Программа должна выводить текст.
•	Текст должен начинаться с "Я думаю".
•	Текст должен заканчиваться на "круто".
•	Текст должен состоять из 33 символов, включая пробелы и знаки препинания.
•	Текст должен состоять из одной строки.
•	Выводимый текст должен соответствовать заданию.
*/

public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код
    }
}
