package com.javarush.task.pro.task07.task0704;

/* 
Экспонентная запись числа
Перед тобой 5 общеизвестных величин.
Перепиши их в более читаемый формат — экспоненциальный. Мантиcса должна представлять собой дробное число от 1.0 до 10.
После изменения формата чисел реальное значение, хранимое в переменной, не должно измениться.

Пример:
109.1678 — обычная форма;
1.091678E+2 — экспонентная форма записи.

Требования:
•	Существующим переменным должны присваиваться значения, записанные в экспонентном виде.
•	Значением мантисы должно быть дробное число от 1.0 до 10.
•	Реальное значение переменных не должно измениться.
*/

public class Solution {
    double earthDiameter = 12742.0;
    double lightSpeed = 299792458.0;
    double uraniumAtomicMass = 238.0289;
    double averageBeeWeight = 0.085;
    double javaDeveloperSalary = 10000.0;
}
