package com.javarush.task.pro.task02.task0214;

import java.util.Scanner;

/*
Считай с клавиатуры три строки.
А затем:

Выведи на экран третью строку в неизменном виде.
Выведи на экран вторую строку, предварительно преобразовав ее к верхнему регистру.
Выведи на экран первую строку, предварительно преобразовав ее к нижнему регистру.
Пример ввода:

Строка Номер РАЗ
Вторая строка
Строка 3
Пример вывода:

Строка 3
ВТОРАЯ СТРОКА
строка номер раз
*/

public class Solution {

    public static void main(String[] args) {
        //напишите тут ваш код
        Scanner input = new Scanner(System.in);

    }
}
