package com.javarush.task.task01.task0103;

/* 
Мой юный друг
/*
Мой юный друг
Сейчас 3126 год. Мой друг родился 8 лет назад.
Написать программу, выводящую на экран год рождения моего друга.

Требования:
•	В программе должен использоваться вывод на экран.
•	Выведенный год должен состоять из 4 цифр.
•	Выведенный год должен начинаться с "31".
•	Выведенный год должен соответствовать заданию.
*/
*/

public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код
    }
}
