package com.javarush.task.pro.task04.task0411;

/* 
Четные числа
Напиши программу, в которой с помощью цикла for на экран будут выведены чётные числа от 1 до 15.
Каждое значение нужно выводить с новой строки.

Требования:
•	Программа должна выводить текст на экран.
•	Программа должна выводить чётные числа от 1 до 15. Каждое значение вывести с новой строки.
•	В программе необходимо использовать цикл for.
*/

public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код

    }
}